app/controllers/entries_controller.rb

  def create
  	@entry = Entry.new(entry_params)
  	if @entry.save!
---
INSERT INTO "entries" ("summary", "created_at", "updated_at") VALUES (?, ?, ?)  [["summary", "as"], ["created_at", 2017-04-06 02:30:39 UTC], ["updated_at", 2017-04-06 02:30:39 UTC]]

  def show
  	@entry = Entry.find(params[:id])
---
SELECT  "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def index
  	@entries = Entry.all
---
SELECT "entries".* FROM "entries"

  def destroy
    @entry = Entry.find(params[:id])
    @entry.destroy!
---
SELECT  "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "entries" WHERE "entries"."id" = ?  [["id", 1]]